
from pymongo import MongoClient
import datetime
import os






# 1 连接 mongo 数据库

client=MongoClient("mongodb://gq:another333@localhost:27017/")

# 2 建立 ctj 数据库 和 ctj 文档
db=client.ctj_db
table=db.ctj_table

# 3 获取ctj原始数据
# 题库列表 tklist=[
    # ('题型','分值','年级','知识点','书名','页码','题号'),
    # ...,
    # ]
ctj_list=[
('选择','3','6','行程问题','2020小升初数学星空卷1','1','一4'),
('填空','3','6','正比例问题','2020小升初数学星空卷1','1','二5'),
('填空','3','6','找规律','2020小升初数学星空卷1','1','二9'),
('填空','3','6','分数应用','2020小升初数学星空卷1','1','二12'),
('计算','5','6','解方程','2020小升初数学星空卷1','1','三13(3)'),
('解答','8','6','组合图形求面积','2020小升初数学星空卷1','2','三17!'), #！表示重要
('解答','10','6','最优化','2020小升初数学星空卷1','2','三19⭐4'), #⭐4表示4星
('填空','3','6','计数原理','2020小升初数学星空卷2','3','二11'), 
('计算','5','6','扇形面积','2020小升初数学星空卷3','5','四22'), 
('填空','3','6','排列组合','2020小升初数学星空卷4','7','一3!'), 
('填空','3','6','正方体分割','2020小升初数学星空卷4','7','一7!'), 
('填空','3','6','逻辑推理','2020小升初数学星空卷4','7','一9!'), 
('填空','3','6','最佳方案','2020小升初数学星空卷4','7','一10'), 
('解答','9','6','图形运动','2020小升初数学星空卷4','8','三21!⭐3'), 
('填空','4','6','分数性质','2020小升初数学星空卷5','9','一10!'), 
('计算','2','6','解方程','2020小升初数学星空卷5','9','二1(2)'), 
('计算','2','6','解方程','2020小升初数学星空卷5','9','二1(3)'), 
('计算','4','6','简便计算','2020小升初数学星空卷5','9','二2(1)'), 
('计算','4','6','简便计算','2020小升初数学星空卷5','9','二2(4)'), 
('计算','4','6','组合图形求面积','2020小升初数学星空卷5','10','二3'), 
('应用','7','6','图形运动','2020小升初数学星空卷5','10','三6⭐4'), 

]

# 4 写入数据库 建立 文档同名 目录
# 把原始数据写入ctj 文档（save方式：有相同id则覆盖无则新增）
# 定义总目录和连接符 全局变量
mkpath=r"d:\\qttc\\"
jsymbol=r'_'
# 定义 写入数据库和建立目录 函数
def wrdb_mkdir(item,table):
    # 建立文档同名目录
    rpath=jsymbol.join(item)
    path=mkpath+rpath
    # 判断路径是否存在
    isExists=os.path.exists(path)
    # 如果没有就创建
    if not isExists:
        ctj_row={
            "type":item[0],     #题型
            "num":int(item[1]),      #分值
            "grade":item[2],    #年级
            "knowledge_points":item[3],     #知识点
            "book_name":item[4],    #书名
            "page_number":item[5],  #页码
            "topic_index":item[6],  #题号
            "recode":[] # 答题记录(答题时间，对错，错误原因)            
        }

        # 写入数据库
        table.save(ctj_row)
        # 建立目录
        os.makedirs(path)
    else:
        print('已经存在')

for item in ctj_list:
    wrdb_mkdir(item,table)
   
client.close()

