# 西瓜视频 up主：陶涛shapan
# 复利交易系统
    # 为什么要建立：
        # 原因
            # 挖水井  图
            # 从众思维 逆向思维 

        # 建立一套系统方法 复制成功 避免 挖水井现象 克服 从众思维

        # 形成时间的持续优势


    # 基本原则 孔子和老子论羊 禅 过去 现在 未来 时间序列
        # 整体 
        # 确切
        # 稳定 即 相对一致
    # 认清价格波动
        # 多小（多数是小波动）、少大（少数是大波动，一年里没几次）
        # 市场不是只有牛熊之分，把市场按照四季来分 即春夏秋冬，更科学，春夏适宜入市操作，秋冬不宜。
            # 市场的春夏秋冬与自然有不同，首先时间不固定，冬季有可能3-5年。
            # 还有就是顺序不固定。

    # 市场操作
        # 胜率
        # 认清机会 
            # 长剑图形   盈亏比（剑身剑把比）为3:1
                # 止损点（剑尾）到买入点（剑卡）即剑的手柄-剑把
                # 买入点（剑卡）到目标掉（剑锋）即剑身

        # 经常性兑现利润，不要怕卖飞了，复利方式，就是积小胜成大胜。 
            # a:做短线获利了，兑现利润后，股票继续涨，后悔！
            # b:做短线浮盈了，舍不得卖，期望更高，但价格回落了，浮盈没了，甚至被套，后悔！
            # 反正都是后悔，前者是赚钱后悔，后者是空手的后悔，所以应该选a，经常性兑现利润。
        # 把市场资金分成多份，1只股票只用一个资金份额。就是分散风险。 
    # 卡位：高胜率的本质就是卡位
        # 四种日常基本图形（多小）：
            # 冲击价格河床上沿。
            # 冲击价格河床下沿。
            # 即冲击价格河床上沿，又冲击价格河床下沿。
            # 交易清淡，即不冲击价格河床上沿，又不冲击价格河床下沿。
        
        # 两种剧烈变动图形（少大）：
            # 突破价格河床上沿，找到新的河床，大幅上升。
            # 突破价格河床下沿，找到新的河床，大幅下跌。

        # 分析计算价格流动河床的定位值区间，就可以知道在什么位置卡位，在什么位置准备做多，在什么位置准备做空，
        # 这个卡的位置，就是前面讲的胜率高的位置，和长剑机会的位置。

        # 怎么计算河床定位值呢？ 